app/Controllers/NewsController.php

SELECT *
FROM `categorias`
WHERE `id` = 'categoria'
---
    public function index()
    {
        $model = model(NewsModel::class);
        $categoriaModel = model(CategoriaModel::class);
        $periodistaModel = model(PeriodistaModel::class);
        $staffModel = model(Staff::class);
        $data = [
            'title' => 'Noticias',
            'categoria' => $categoriaModel->where('id', 'categoria')->find(),