app/Models/NewsModel.php

SELECT *
FROM `news`
ORDER BY `id` DESC
---
    public function getNews($slug = false) {
        if ($slug === false) {
            return $this->orderBy('id', 'desc')->findAll();