app/Models/StaffModel.php

    public function getStaff($slug = false) {
        if ($slug === false) {
            return $this->orderBy('id', 'desc')->findAll();
---
SELECT *
FROM `staffs`
ORDER BY `id` DESC